# -*- mode: org; fill-column: 78; -*-
# Time-stamp: <2026-01-09 15:50:38 krylon>
#
#+TAGS: internals(i) ui(u) bug(b) feature(f)
#+TAGS: database(d) design(e), meditation(m)
#+TAGS: optimize(o) refactor(r) cleanup(c)
#+TODO: TODO(t)  RESEARCH(r) IMPLEMENT(i) TEST(e) | DONE(d) FAILED(f) CANCELLED(c)
#+TODO: MEDITATE(m) PLANNING(p) | SUSPENDED(s)
#+PRIORITIES: A G D

* Chili [0/0]
  :PROPERTIES:
  :COOKIE_DATA: todo recursive
  :VISIBILITY: children
  :END:
** Clocktable
   #+BEGIN: clocktable :scope file :maxlevel 255 :emphasize t
   #+CAPTION: Clock summary at [2026-01-09 Fr 15:50]
   | Headline               | Time    |         |      |      |
   |------------------------+---------+---------+------+------|
   | *Total time*           | *11:55* |         |      |      |
   |------------------------+---------+---------+------+------|
   | *Chili [0/0]*          | *11:55* |         |      |      |
   | \_  /Components [0/0]/ |         | /11:55/ |      |      |
   | \_    Data model [0/0] |         |         | 5:35 |      |
   | \_    Database [0/0]   |         |         | 6:17 |      |
   | \_      Testing        |         |         |      | 0:10 |
   | \_    Main [0/0]       |         |         | 0:03 |      |
   #+END:
** Components [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
*** Data model [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2026-01-08 Do 15:06]--[2026-01-08 Do 15:37] =>  0:31
    CLOCK: [2026-01-07 Mi 15:45]--[2026-01-07 Mi 15:50] =>  0:05
    CLOCK: [2026-01-07 Mi 15:07]--[2026-01-07 Mi 15:07] =>  0:00
    CLOCK: [2026-01-06 Di 15:20]--[2026-01-06 Di 20:19] =>  4:59
    :END:
*** Database [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2026-01-09 Fr 15:04]--[2026-01-09 Fr 15:40] =>  0:36
    CLOCK: [2026-01-08 Do 15:40]--[2026-01-08 Do 18:19] =>  2:39
    CLOCK: [2026-01-08 Do 14:56]--[2026-01-08 Do 15:06] =>  0:10
    CLOCK: [2026-01-07 Mi 18:08]--[2026-01-07 Mi 19:02] =>  0:54
    CLOCK: [2026-01-07 Mi 16:26]--[2026-01-07 Mi 17:07] =>  0:41
    CLOCK: [2026-01-07 Mi 15:55]--[2026-01-07 Mi 16:24] =>  0:29
    CLOCK: [2026-01-07 Mi 15:07]--[2026-01-07 Mi 15:45] =>  0:38
    :END:
**** Testing
     :LOGBOOK:
     CLOCK: [2026-01-09 Fr 15:40]--[2026-01-09 Fr 15:50] =>  0:10
     :END:
*** Network Scanner [0/0]
*** Host Probe [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
*** Web UI [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
*** Main [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2026-01-07 Mi 15:50]--[2026-01-07 Mi 15:53] =>  0:03
    :END:
    The entry point and user-facing part of the application
** Features [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
** Bugs [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:

   
